[
  {
    "title": "Plataforma de Gestión de Proyectos",
    "description": "Una aplicación web para la gestión de tareas y proyectos en equipo, con tableros Kanban, asignación de tareas y seguimiento de progreso en tiempo real.",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "Firebase",
      "React Query"
    ],
    "link": "https://github.com/joset98/octo-condo-manager",
    "app_link": "https://github.com/joset98/octo-condo-manager",
    "image": "/placeholder.svg"
  },
  {
    "title": "Sitio Web para Fotógrafo",
    "description": "Un portafolio visualmente atractivo para un fotógrafo profesional, optimizado para SEO y con un rendimiento de carga de imágenes excepcional.",
    "technologies": [
      "Astro",
      "React",
      "Tailwind CSS",
      "Cloudinary"
    ],
    "link": "https://github.com/joset98/academic-react",
    "app_link": "https://github.com/joset98/octo-condo-manager",
    "image": "/placeholder.svg"
  },
  {
    "title": "Octo-Condo: Sistema Full-Stack para la Gestión de Condominios",
    "description": "Octo-Condo es una solución de software completa, diseñada bajo una arquitectura cliente-servidor, para automatizar y simplificar la administración de condominios. El sistema se compone de dos proyectos principales: un backend robusto (octo-condo-api-engine) y una interfaz de usuario intuitiva (octo-condo-manager).",
    "full_description": "Backend (octo-condo-api-engine):\n\nDesarrollado con NestJS (Node.js/TypeScript), este motor es el cerebro de la aplicación. Sus responsabilidades clave incluyen:\n\nLógica de Negocio Centralizada: Automatiza el cálculo de las cuotas mensuales, prorrateando los gastos comunes entre las unidades según su alícuota y asignando gastos privados.\nAPI REST Segura: Expone endpoints para todas las operaciones, protegidos con autenticación basada en JWT y un sistema de roles (ADMIN, OWNER) que garantiza que los usuarios solo accedan a la información y acciones permitidas.\nGeneración Dinámica de PDF: Una de las características más destacadas es la capacidad de generar recibos de pago y reportes detallados en formato PDF. Utiliza Puppeteer para convertir plantillas HTML dinámicas, asegurando documentos profesionales y precisos.\nIntegración con Servicios Externos: Se conecta a APIs de terceros para obtener la tasa de cambio de moneda en tiempo real (ej. BCV), permitiendo presentar los montos en múltiples divisas (USD y Bs.) en los recibos, una funcionalidad crucial para el contexto venezolano.\n\nFrontend (octo-condo-manager):\n\nEs la aplicación web con la que interactúan los usuarios. Aunque es un proyecto separado, está diseñado para consumir la API del backend y ofrecer una experiencia de usuario fluida para dos perfiles principales:\n\nPanel de Administración: Permite a los administradores registrar gastos, generar las cuotas de todo el condominio con un solo clic, validar pagos y gestionar la información de los residentes.\nPortal del Propietario: Ofrece a los residentes un acceso seguro para consultar su estado de cuenta, ver el desglose de sus cuotas y descargar sus recibos de pago en PDF en cualquier momento.\n\nEn conjunto, Octo-Condo demuestra la capacidad de construir una aplicación full-stack escalable y orientada a resolver un problema del mundo real, integrando lógica de negocio compleja, seguridad, y manipulación avanzada de documentos.",
    "technologies": [
      "NestJS",
      "Node.js",
      "TypeScript",
      "Puppeteer",
      "JWT",
      "Next.js",
      "React",
      "Tailwind CSS"
    ],
    "link": "https://github.com/joset98/octo-condo-api-engine",
    "app_link": "https://github.com/joset98/octo-condo-manager",
    "image": "/placeholder.svg"
  },
  {
    "title": "Sitio Web para Fotógrafo",
    "description": "Un portafolio visualmente atractivo para un fotógrafo profesional, optimizado para SEO y con un rendimiento de carga de imágenes excepcional.",
    "technologies": [
      "Astro",
      "React",
      "Tailwind CSS",
      "Cloudinary"
    ],
    "link": "https://github.com/joset98/photo-portfolio",
    "image": "/placeholder.svg"
  },
  {
    "title": "Sitio Web para Fotógrafo",
    "description": "Un portafolio visualmente atractivo para un fotógrafo profesional, optimizado para SEO y con un rendimiento de carga de imágenes excepcional.",
    "technologies": [
      "Astro",
      "React",
      "Tailwind CSS",
      "Cloudinary"
    ],
    "link": "https://github.com/joset98/photo-portfolio",
    "image": "/placeholder.svg"
  }
]